Repository: abeluck/cleanroom
Catalog: wiki/src/doc/first_steps/usb_installation.*.po
Languages: pt

source: [[!meta title="Installing onto a USB Stick"]]
pt: [[!meta title="Instalando em uma memória USB"]]

source: Tails, version 0.11 or later, includes a custom USB installer.
pt: Tails, versão 0.11 ou superior, inclui um instalador USB personalizado.

source: <span class="application">Tails USB installer</span> allows you to **[[create a persistent volume|persistence]]** in the free space left on the USB stick. It requires a USB stick of **at least 2 GB**.
pt: <span class="application">Instalador USB do Tails</span> te permite **[[criar um persistent volume|persistence]]** no espaço livre no pendrive. Isto requer um dispositivo USB com **mais de 2 GB**.

source: In order to use <span class="application">Tails USB installer</span>, you need to start Tails from another media, and clone it onto the USB stick that you want to install. You can either:
pt: Para usar o <span class="application">Tails USB installer</span>, você precisa iniciar o Tails a partir de outra mídia, e clona-lo para a memória USB que você quer instalar. Você pode tanto:

source: **[[Burn a Tails DVD|download#support]]** (recommended).
pt: **[[Queimar um Tails DVD|download#support]]** (recomendado).

source: **Use another Tails USB stick**, version 0.11 or later, for example from a friend.
pt: **Usar outro dispositivo USB com Tails**, versão 0.11 ou superior, de um amigo por exemplo.

source: **[[Manually install Tails onto another USB stick|manual_usb_installation]]**, if you can't use a DVD.
pt: **[[Instalação manual de outro dispositivo USB|manual_usb_installation]]**, se você não pode usar um DVD.

source: Instructions
pt: Instruções

source: <div class="caution"> <strong>The content of the USB stick will be lost in the operation.</strong> </div>
pt: <div class="caution"> <strong>O conteúdo do pendrive será perdido.</strong> </div>

source: Start Tails, version 0.11 or later, from another media than the USB stick onto which you want to install Tails.
pt: Inicie o Tails, versão 0.11 ou superior, de outra mídia como um pendrive do qual você quer instalar o Tails.

source: 2. Choose <span class="menuchoice"> <span class="guimenu">Applications</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Tails USB installer</span> </span> to start <span class="application">Tails USB installer</span>.
pt: 2. Escolha <span class="menuchoice"> <span class="guimenu">Aplicativos</span>&nbsp;▸ <span class="guisubmenu">Tails</span>&nbsp;▸ <span class="guimenuitem">Tails USB installer</span> </span> to start <span class="application">Tails USB installer</span>.

source: To install onto a new USB stick, click on the <span class="button">Clone & Install</span> button.
pt: Para instalar em um pendrive novo, clique no botão <span class="button">Clone & Install</span>.

source: Plug the USB stick onto which you want to install Tails.
pt: Insira o pendrive no qual deseja instalar o Tails

source: A new device, which corresponds to the USB stick, appears in the <span class="guilabel">Target Device</span> drop-down list.
pt: Um novo dispositivo, qual corresponde ao pendrive, aparecerá na lista suspensa <span class="guilabel">Dispositivo de destino</span>.

source: Choose the USB stick from the <span class="guilabel">Target Device</span> drop-down list.
pt: Escolha o pendrive na lista suspensa <span class="guilabel">Dispositivo de destino</span>.

source: 6. To start the installation, click on the <span class="button">Create Live USB</span> button.
pt: 6. Para iniciar a instalação, clique no botão <span class="button">Create Live USB</span>.

source: Read the warning message in the text area. Click on the <span class="button">Next</span> button to confirm.
pt: Leia a mensagem de aviso na área de texto. Clique no botão <span class="button">Next</span> para confirmar.
