Repository: abeluck/cleanroom
Catalog: wiki/src/doc/encryption_and_privacy/openpgp_passphrase_encryption.*.po
Languages: fr

source: [[!meta title="OpenPGP passphrase encryption"]]
fr: [[!meta title="Chiffrement avec OpenPGP et une phrase secrète"]]

source: Tails proposes you a custom applet to **encrypt text with a passphrase** using OpenPGP passphrase encryption.
fr: Tails vous propose une applet sur mesure afin de **chiffrer vos textes avec une phrase secrète** en utilisant une phrase secrète chiffrée OpenPGP.

source: **It is unsafe to write confidential text in a web browser** since Javascript attacks can access it from inside the browser. You should rather write your text in a separate application, encrypt it with gpgApplet and then paste the encrypted text in your browser, before sending it by email for example.
fr: **Il est risqué d'écrire des informations confidentielles dans un navigateur web** car des attaques Javascript peuvent y avoir accès. Vous devriez plutôt écrire votre texte à l'aide d'une autre application, le crypter grâce à gpgApplet et coller le résultat dans votre navigateur, afin de l'envoyer par mail par exemple.

source: This technique requires you to share a secret passphrase with the people that will need to decrypt the message. OpenPGP also allows you to use public-key cryptography to send confidential messages without having a shared passphrase. [[See the corresponding documentation.|openpgp_with_gedit]]
fr: Cette technique nécessite le partage d'une phrase de passe secrète avec les personnes qui doivent décrypter le message. OpenPGP vous permet, grâce à la cryptographie par clé publique, de partager des informations confidentielles sans avoir à partager une phrase de passe. [[Voir la documentation correspondante.|openpgp_with_gedit]]

source: Encrypt text with a passphrase
fr: Crypter du texte avec une phrase de passe

source: <h2 class="bullet-number-one">Write your message in the text editor</h2>
fr: <h2 class="bullet-number-one">Ecrivez votre message dans un éditeur de texte</h2>

source: Open gedit from the menu **Applications** → **Accessories** → **gedit Text Editor**.
fr: Ouvrir gedit depuis le menu **Applications** → **Accessoires** → **Editeur de Texte gedit**.

source: [[!img gedit.png link=no alt="gedit Text Editor"]]
fr: [[!img gedit.png link=no alt="Editeur de texte gedit"]]

source: Write your text.
fr: Ecrivez votre texte

source: [[!img gedit_confidential_message.png link=no alt="Confidential message in gedit"]]
fr: [[!img gedit_confidential_message.png link=no alt="Message confidentiel dans gedit"]]

source: <h2 class="bullet-number-two">Encrypt it with a passphrase using gpgApplet</h2>
fr: <h2 class="bullet-number-two">Cryptez-le avec une phrase de passe grâce à gpgApplet</h2>

source: **Select it** with the mouse. Copy it into the clipboard by doing **right-click** → **Copy**.
fr: **Selectionnez le** avec la souris. Copiez-le dans le presse papier en faisant **clic-droit** → **Copier**.

source: [[!img copy.png link=no alt="Right-click → Copy"]]
fr: [[!img copy.png link=no alt="Clic-droit → Copier"]]

source: **The logo of the gpgApplet should represent lines of text**, meaning that the clipboard contains non-encrypted text:
fr: **Le logo de gpgApplet devrait représenter des lignes de texte**, ce qui signifie que le presse papier contient du texte non crypté.

source: [[!img gpgapplet_with_text.png link=no alt="gpgApplet without a lock"]]
fr: [[!img gpgapplet_with_text.png link=no alt="gpgApplet sans cadenas"]]

source: Click on the applet and select **Encrypt Clipboard** from the menu.
fr: Cliquez sur l'icône gpgApplet dans la barre des tâches et sélectionnez **Crypter le Presse Papier** dans le menu

source: The applet will prompt you with a passphrase twice.
fr: L'applet vous demandera d'entrer deux fois la phrase de passe.

source: [[!img enter_passphrase.png link=no alt="Enter passphrase"]]
fr: [[!img enter_passphrase.png link=no alt="Entrez une phrase de passe"]]

source: **The logo of the gpgApplet should now show a lock**, meaning that the clipboard contains encrypted text:
fr: **Le logo de gpgApplet devrait maintenant faire apparaître un cadenas**, ce qui signifie que le contenu du presse papier est maintenant crypté

source: [[!img gpgapplet_with_lock.png link=no alt="gpgApplet with a lock"]]
fr: [[!img gpgapplet_with_lock.png link=no alt="gpgApplet avec un cadenas"]]

source: <h2 class="bullet-number-three">Paste your encrypted text</h2>
fr: <h2 class="bullet-number-three">Coller votre message crypté</h2>

source: Now paste this encrypted text in another application by doing **right-click** → **Paste**. For example, paste it in the web browser in order to send it by email.
fr: Maintenant, coller votre message crypté dans l'application de votre choix en faisant **Clic-droit** → **Coller**. Vous pouvez par exemple le coller dans votre navigateur web dans le but de l'envoyer par mail.

source: [[!img browser_paste.png link=no alt="Right-click → Paste"]]
fr: [[!img browser_paste.png link=no alt="Clic-Droit → Coller"]]

source: [[!img browser_encrypted_text.png link=no alt="Right-click → Paste"]]
fr: [[!img browser_encrypted_text.png link=no alt="Clic-Droit → Coller"]]

source: Decrypt encrypted text
fr: Décrypter un message

source: To decrypt an encrypted text you can do the reverse operation.
fr: Pour décrypter un message, vous devez faire l'opération inverse.

source: <h2 class="bullet-number-two">Copy the encrypted text into the clipboard</h2>
fr: <h2 class="bullet-number-two">Copiez le message crypté dans le presse papier</h2>

source: **Select the encrypted text that you want to decrypt** with the mouse. Copy it into the clipboard by doing **right-click** → **Copy**.
fr: **Sélectionnez le message que vous voulez décrypter** avec la souris. Copiez-le dans le presse papier en faisant **Clic-droit** → **Copier**.

source: [[!img browser_received_email.png link=no alt="Selected BEGIN PGP MESSAGE"]]
fr: [[!img browser_received_email.png link=no alt="Selecionner BEGIN PGP MESSAGE"]]

source: **The logo of the gpgApplet should show a lock**, meaning that the clipboard contains encrypted text:
fr: **Le logo de gpgApplet devrait maintenant faire apparaître un cadenas**, ce qui signifie que le contenu du presse papier est crypté

source: <h2 class="bullet-number-two">Decrypt it using gpgApplet</h2>
fr: <h2 class="bullet-number-two">Decryptez-le avec gpgApplet</h2>

source: Click on the gpgApplet and select **Decrypt/Verify** from the menu.
fr: Cliquez sur l'icône gpgApplet dans la barre des tâches et sélectionnez **Décrypter/Vérifier** dans le menu

source: [[!img decrypt_verify.png link=no alt="Decrypt/Verify"]]
fr: [[!img decrypt_verify.png link=no alt="Décrypter/Vérifier"]]

source: The applet should prompt you with a decrypted version of the text.
fr: L'applet devrait afficher le message décrypté.

source: [[!img gpgapplet_decrypted_text.png link=no alt="Decrypted text in a popup window"]]
fr: [[!img gpgapplet_decrypted_text.png link=no alt="Message décrypté dans une fenêtre"]]
