Repository: abeluck/cleanroom
Catalog: wiki/src/about.*.po
Languages: fr

source: [[!meta title="About"]]
fr: [[!meta title="À propos"]]

source: <em>The (Amnesic) Incognito Live System</em> (<a href='http://en.wikipedia.org/wiki/Live_CD'>Live CD</a>, <a href='http://en.wikipedia.org/wiki/Live_USB'>Live USB</a>) is aimed at preserving your privacy and anonymity:
fr: <em>Le système Live (<a href='http://fr.wikipedia.org/wiki/Live_CD'>Live CD</a>, <a href='http://fr.wikipedia.org/wiki/Live_USB'>Live USB</a>) (amnésique) Incognito (T(A)ILS en anglais) a pour but de préserver votre confidentitialité et votre anonymat :

source: all outgoing connections to the Internet are forced to go through <a href='https://www.torproject.org/'>the Tor network</a>;
fr: Toutes les connexions sortantes vers Internet passent obligatoirement par <a href='https://www.torproject.org/'>le réseau Tor</a> ;

source: no trace is left on local storage devices unless explicitely asked.
fr: Aucune trace n'est laissée sur les médias de stockage à moins qu'on le demande explicitement.

source: It has many other [[features]].
fr: Ce système comporte beaucoup d'autres [[features|fonctionnalités]].

source: warning
fr: avertissement

source: T(A)ILS heavily relies on Tor for its privacy features. Tor is experimental software based on current computer science research and thus it cannot guarantee strong anonymity. A good starting point for evaluating what kind of anonymity you can expect from Tor (and by extension T(A)ILS) is the <a href="https://www.torproject.org/about/overview.html">About Tor</a> section of <a href="https://www.torproject.org/">The Tor Project's website</a>.
fr: T(A)ILS repose sur Tor pour ses fonctionnalités de confidentialité. Tor est un logiciel expérimental basé sur la recherche actuelle en informatique, et ne peut donc garantir un anonymat sûr. Un bon point de départ pour évaluer quel anonymat fournit Tor (et par extension T(A)ILS) est la section <a href=\"https://www.torproject.org/about/overview.html\">Au sujet de Tor</a> du <a href=\"https://www.torproject.org/\">site de Tor</a>.

source: license
fr: licence

source: The (Amnesic) Incognito Live System is <a href='http://www.gnu.org/philosophy/free-sw.html'>Free Software</a> released under the GNU/GPL (version 3 or above).
fr: T(A)ILS est un <a href='http://www.gnu.org/philosophy/free-sw.html'>Logiciel Libre</a> publié sous la licence GNU/GPL (version 3 ou supérieure).

source: acknowledgements
fr: crédits

source: <em>The (Amnesic) Incognito Live System</em> could not exist without <a href='http://live.debian.net/'>Debian Live</a> and <a href='https://www.torproject.org/'>Tor</a>;
fr: <em>T(A)ILS</em> ne pourrait pas exister sans<a href='http://live.debian.net/'>Debian Live</a> et <a href='https://www.torproject.org/'>Tor</a>;

source: <em>T(A)ILS</em> was inspired by the <a href='http://anonymityanywhere.com/incognito/'>Incognito LiveCD</a>. The Incognito author <a href='http://www.anonymityanywhere.com/incognito/'>has declared it to be dead</a> on March 23, 2010, and written that The (Amnesic) Incognito Live System "should be considered as its spiritual successor".
fr: <em>T(A)ILS</em> est inspiré de <a href='http://anonymityanywhere.com/incognito/'>Incognito LiveCD</a>. L'auteur d'Incognito <a href='http://www.anonymityanywhere.com/incognito/'> a annoncé la mort de son projet le 23 mars 2010 et déclaré que T(A)ILS "devrait être considéré comme son héritier spirituel".

source: The <a href='http://mandalka.name/privatix/'>Privatix Live-System</a> was an early source of inspiration, too.
fr: Le système Live <a href='http://mandalka.name/privatix/'>Privatix</a> fut également une source d'inspiration au départ du projet.
