Repository: abeluck/cleanroom
Catalog: wiki/src/build.*.po
Languages: de

source: One may want to [[customize]] her image before building.
de: Es ist möglich, ein Abbild vor dem eigentlichen Erstellungsprozess [[individuell anzupassen|customize]].

source: Every following command must be run as `root`, at the root of the source directory one has [[downloaded|download]].
de: Alle folgenden Instruktionen müssen als `root` ausgeführt werden, im Verzeichnis, das [[heruntergeladen|download]] wurde.

source: For the impatient ones:
de: Für die Ungeduldigen:

source: Dependencies
de: Abhängigkeiten

source: We recommend using a `live-helper` package newer than the one in Lenny: the [Debian Live manual](http://live.debian.net/manual/html/) explains how to install a snapshot package.
de: Wir empfehlen, ein `live-helper`-Paket zu benutzen, das aktueller ist als das in Debian Lenny: Das [Debian Live Manuell](http://live.debian.net/manual/html/) erklärt, wie man ein aktuelles Paket installiert.

source: A patched ikiwiki is probably needed; see this [wishlist item](http://ikiwiki.info/todo/mirrorlist_with_per-mirror_usedirs_settings/) to get the custom ikiwiki branch that has the needed code.
de: Eine gepatchte Version von ikiwiki wird wahrscheinlich benötigt; siehe [Wunschzettel](http://ikiwiki.info/todo/mirrorlist_with_per-mirror_usedirs_settings/) für die ikiwiki-Version (branch), die den benötigten Code enthält.

source: Build process
de: Erstellungsprozess

source: Initialize the Live system's configuration with `lh_config`:
de: Die Konfiguration des Livesystems wird per `lh_config` initialisiert:

source: Optionally set your preferred language for the generated images; only "fr" is currently fully supported, but other languages are still worth trying, such as "de" or en":
de: Optionnel kann die bevorzugte Sprache für die generierten Abbilder bestimmt werden; zur Zeit wird nur "fr" vollständig unterstützt, aber andere Sprachen sind auch einen Versuch wert, wie z.B. "de" oder "en".

source: You can then use the standard live-helper commands to build the chosen images (`lh build`) and to cleanup the build directory (`lh clean`).
de: Nun können die live-helper Instruktionen normal benutzt werden, um ein Abbild zu erstellen (`lh build`) und um das Verzeichnis zu säubern (`lh clean`).
