Repository: abeluck/cleanroom
Catalog: wiki/src/download.*.po
Languages: fr

source: [[!meta title="Download T(A)ILS"]]
fr: [[!meta title="Télécharger T(A)ILS"]]

source: Every ISO image we ship is a hybrid one:
fr: Toutes les images ISO que nous fournissons sont hybrides :

source: it can be burnt to a CD;
fr: elles peuvent être gravées sur CD ;

source: it also contains a full disk image (including partition table) and can thus be copied (using <code>cat</code> or <code>dd</code>) to a USB stick; the USB stick's content is lost in the operation.
fr: elles contiennent aussi une image disque complète (avec table de partitions) qui peut ainsi être copiée (en utilisant <code>cat</code> ou <code>dd</code>) vers une clé USB ; le contenu de la clé USB est effacé pendant cette operation.

source: Any help to spread T(A)ILS is more than welcome: don't hesitate seeding our Torrents. If you want to setup a web mirror, please [[drop us an email|contribute]]. <strong>FIXME</strong>: link to the related documentation page.
fr: Toute aide pour diffuser T(A)ILS est chaleureusement bienvenue : n'hésitez pas à partager vos Torrents. Si vous voulez installer un miroir web, [[envoyez un message|contribute]].<strong>FIXME</strong>: lien vers la page de doc.

source: If you are interested in the source code, have a look to our [[dev zone|contribute]].
fr: Si le code source vous intéresse, regardez la [[zone de développement|contribute]].

source: 1. Download the image
fr: 1. Télécharger l'image

source: ISO images can be downloaded using BitTorrent or over HTTP.
fr: Les images ISO peuvent être téléchargées par BitTorrent ou par HTTP.

source: Here are the latest available BitTorrent files (<code>.torrent</code>): [[!map pages="torrents/files/*.torrent"]]
fr: Voici les derniers fichiers BitTorrent (<code>.torrent</code>) disponibles&nbsp;: [[!map pages="torrents/files/*.torrent"]]

source: Cryptographic signatures and checksums
fr: Signatures cryptographiques et sommes de contrôle

source: Here are the OpenPGP signatures (<code>.asc</code>) and checksums (<code>.sha256</code>) for the BitTorrent files listed above: [[!map pages="torrents/files/*.torrent.asc or torrents/files/*.torrent.sha256"]]
fr: Voici les signatures OpenPGP (<code>.asc</code>) et les sommes de contrôle (<code>.sha256</code>) des fichiers BitTorrent listés ci-dessus&nbsp;: [[!map pages="torrents/files/*.torrent.asc or torrents/files/*.torrent.sha256"]]

source: Direct download (HTTP)
fr: Téléchargement direct (HTTP)

source: Latest release
fr: Dernière version

source: Here it is:
fr: La voici :

source: Please <a href='/found_a_problem/'>drop us an email</a> if you happen to meet a non-working mirror, preferably including the faulty mirror's IP address if you can.
fr: Merci de <a href='/found_a_problem/'>nous contacter</a> si vous trouvez un miroir qui ne fonctionne pas, de préférence (et si possible) en incluant l'adresse IP de ce miroir.

source: Release candidates
fr: Versions candidates

source: <strong>Warning!</strong> Please try release candidates for testing purposes but do <strong>not</strong> rely on these for anything. No guarantee, blablabla. Anyway, here they are:
fr: <strong>Attention !</strong> Merci d'essayer les versions candidates uniquement dans un but de test, mais ne vous y fiez <strong>PAS</strong>. Pas de garantie, blablabla. Ceci dit, elles sont là :

source: 2. Verify the downloaded image integrity
fr: 2. Vérifier l'intégrité de l'image

source: The released images are signed with our [[GnuPG key]]; you can, and should, verify their integrity before using them. Example:
fr: Les images publiées sont signées avec notre [[clef GnuPG|GnuPG key]] ; vous pouvez, et devriez, vérifier leur intégrité avant de les utiliser. Par exemple :

source: FIXME: explain a user-friendly way to do so
fr: (FIXME : expliquer comment faire)

source: 3. Install the system
fr: 3. Installer le système

source: mention Intel-based Mac users sometimes need to upgrade their firmware to get the keys working in the syslinux menu
fr: mentionner que les utilisateurs de Mac-Intel doivent parfois mettre à jour leur firmware pour que le clavier fonctionne dans le menu syslinux

source: 4. Stay tuned!
fr: 4. Suivez les nouveautés !
