Repository: abeluck/cleanroom
Catalog: wiki/src/doc/trust.*.po
Languages: fr

source: [[!meta title="Trusting Tails"]]
fr: [[!meta title="Avoir confiance en Tails"]]

source: Trust is a very problematic issue, and that's the essence of why security is difficult in every field, including computers and Internet communication. Do you trust Tails and its developers? Do you think we have planted backdoors in Tails so we can take control of your computer, or that we make Tails generate compromised encryption keys in order to enable the government to spy on you? Do you simply trust our word on that we are legit?
fr: La confiance est une question délicate, et c'est bien pourquoi la sécurité est un problème compliqué dans chaque domaine, notamment concernant les communications via internet et l'informatique de manière générale. Avez-vous confiance dans Tails et ses développeurs ? Croyez-vous que nous avons mis des "portes d'entrée" dans Tails afin de prendre le contrôle de votre ordi, ou que Tails génère des clés de chiffrement corrompues afin de permettre au gouvernement de vous espionner ? Avez-vous simplement confiance en notre parole ?

source: No matter what your opinion is in this matter you should ask how you reached that conclusion. Both trust and distrust need to be established based on facts, not gut feeling, paranoid suspicion, unfounded hearsay or our word. Of course, we claim to be honest, but written assurances are worthless. In order to make an informed decision you must look at the greater picture of what Tails is comprised of, our affiliations, and possibly how others trust us.
fr: Peu importe votre opinion en la matière, vous devriez vous demandez comment vous êtes arrivé à cette conclusion. La confiance autant que son absence doivent être basées sur des faits, pas sur des préssentiments, une suspicion parano, des on-dit à propos de nous. Bien sûr, on prétend être honnête, mais une prétention écrite ne vaut rien. Afin de faire un choix éclairé, vous devez prendre du recul et considérez ce dont fait partie Tails, ses liens, et pourquoi pas comment d'autres nous font confiance.

source: Free software and public scrutiny
fr: Logiciel libre et examen publique

source: Free software, [[like Tails|license]], enables its users to check exactly what the software distribution consists of and how it functions since the source code must be made available to all who receive it. Hence a thorough audit of the code can reveal if any malicious code, like a backdoor, is present. Furthermore, with the source code it is possible to build the software, and then compare the result against any version that is already built and being distributed, like the Tails CD images [[you can download from us|download]]. That way it can be determined whether the distributed version actually was built with the source code, or if any malicious changes have been made.
fr: Un logiciel libre, comme [[Tails|license]], permet à ceux qui l'utilisent de regarder précisement en quoi consiste la distribution du logiciel et comment il fonctionne, à partir du code source, qui doit être disponible pour tous. Ainsi, un audit approfonci du code peut révéler la présence de code malveillant, comme une porte d'entrée per exemple. De plus, il est possible de construire le logiciel depuis le code source, et de comparer le résultat obtenu avec n'importe quelles versions déjà existantes, distribuées, comme les images CD de Tails que [[vous pouvez télécharger|download]]. Il est ainsi possible de savoir si la version distribuée est celle provenu du code source ou bien une version modifiée au passage.

source: Of course, most people do not have the knowledge, skills or time required to do this, but due to public scrutiny anyone can have a certain degree of implicit trust in Free software, at least if it is popular enough that other developers look into the source code and do what was described in the previous paragraph. After all, there is a strong tradition within the Free software community to publicly report serious issues that are found within software.
fr: Bien sûr, la plupart des gens n'ont pas notre savoir en la matière, ni les compétences ou le temps demandé pour faire cela, mais grâce à la politique d'examen publique, n'importe qui peut avoir un certain degré de confiance implicite dans les logiciels libres, au moins si ils sont assez populaires pour que d'autres développeurs jettent un oeil au code source et fassent ce que nous venons de décrire. Après tout, il y a une forte tradition dans la communauté du logiciel libre de faire savoir tout problème sérieux découvert dans un logiciel.

source: Trusting GNU/Linux Debian
fr: Avoir confiance dans GNU/Linux Debian

source: The vast majority of all software shipped in Tails comes from the [[Debian GNU/Linux distribution|http://www.debian.org/]]. Debian is arguably the Linux distribution whose software packages are under the deepest public scrutiny. Not only is Debian itself one of the largest Linux distros, but it's also one of the most popular distros to make derivatives from. Ubuntu Linux, for instance, is a Debian derivative, and the same goes transitively for all of its derivatives, like Linux Mint. Thus there are countless people using Debian's software packages, and countless developers inspect their integrity. Very serious security issues have been discovered (like the infamous [[Debian SSH PRNG vulnerability|https://lists.debian.org/debian-security-announce/2008/msg00152.html]]), but backdoors or other types of intentionally placed security holes have never been found to our knowledge.
fr: La grande majorité des logiciels livrés dans Tails proviennent de la [[distribution Debian GNU/Linux|http://www.debian.org/]]. Debian est la distribution Linux dont, et c'est de notoriété publique, les logiciels fournis via les paquets subissent un examen publique des plus approfondis. Debian n'est pas seulement une des plus importante distribution Linux, c'est également une des plus populaires, sur laquelle bien d'autres distributions sont basées. Ubuntu Linux par exemple, est basée sur Debian, et ça vaut pour tous ses dérivés, comme Linux Mint. Il y a donc un nombre incalculable de personnes utilisant les logiciels fournis dans Debian, et un grand nombre de développeurs vérifient leur intégrité. Des problèmes de sécurités très importants ont été découverts (comme la fameuse [[vulnérabilité SSH PRNG Debian|https://lists.debian.org/debian-security-announce/2008/msg00152.html]]), mais des portes d'entrées, ou d'autres types de trous de sécurités intentionnels n'ont pas été trouvés, à ce qu'on sait.

source: Trusting Tor
fr: Avoir confiance en Tor

source: Tails anonymity is based on Tor, which is developed by [[The Tor Project|https://www.torproject.org/]]. The development of Tor is under a lot of public scrutiny both academically (research on attacks and defenses on onion routing) and engineering-wise (Tor's code has gone through several external audits, and many independent developers have read through the sources for other reasons). Again, security issues have been reported, but nothing malicious like a backdoor -- we would argue that it's only uninformed conspiracy theorists that speculate about deliberate backdoors in Tor these days. Furthermore, Tor's distributed trust model makes it hard for a single entity to capture an individual's traffic and effectively identify them.
fr: L'anonymat de Tails est basé sur Tor, développé par le [[Tor Project|https://www.torproject.org/]]. Le développement de Tor est soumis de de nombreux examens publiques, à la fois académique (recherches sur des attaques et défenses) et privé (le code de Tor a subit moult audits externes, et plusieurs développeurs indépendants l'ont examiné pour d'autres raisons). Encore une fois, des problèmes de sécurité ont été trouvé, mais rien de malveillant comme une porte d'entrée -- on dirions que seuls des adeptes de la théorie du complot mal informés spécule sur des portes d'entrées intentionnelles dans Tor à l'heure actuelle. Enfin, le modèle de confiance de Tor rend compliqué pour une seule personne de capturer un traffic individuel et d'effectivement l'identifier.

source: Trusting Tails
fr: Avoir confiance en Tails

source: One could say that Tails is the union of Debian and Tor. What we do, essentially, is gluing it all together. Hence, if you trust Debian and The Tor Project, what remains to establish trust for Tails is to trust our "glue". As has been mentioned, Tails if Free software, so it's source code is completely open for inspection, and it's mainly comprised by a specification of which Debian software packages to install, and how they should be configured. While Tails surely doesn't get the same amount of attention as Debian or Tor, we do have some eyes on us from especially the Tor community, and also some of the general security community (see our [[audits page|security/audits]]). Given that Tails' source code is comparably small and devoid of complexities, we're in a pretty good spot compared to many other projects of similar nature. Our [[specification and design document|contribute/design]] is a good starting point to understand how Tails works, by the way.
fr: On pourrait dire que Tails est l'union de Debian et Tor. Ce qu'on fait essentiellement, c'est de coller le tout ensemble. De coup, si vous faites confiance à la fois à Tor et à Debian, ce qu'il reste pour faire confiance à Tails est de faire confiance à notre manière de "coller tout ensemble". Comme dit pus haut, Tails est un logiciel libre, son code source est disponible à tout examen, and it's mainly comprised by a specification of which Debian software packages to install, and how they should be configured. Bien que Tails ne bénéficie pas d'autant d'attention que Debian ou Tor, on a une attention de la part de la communauté Tor, ainsi que de la part de certaines communautés de sécurité générale (voir notre [[page d'audits|security/audits]]). Etant donné que le code de Tails est plutôt petit et exempt de complexité, on est bien placé par rapport à d'autres projects de même nature. En passant, notre page [[conception de Tails|contribute/design]] est un bon point de départ pour comprendre comment Tails fonctionne.

source: With all this in light (which you ideally also should try to verify), you should be able to make an informed decision on whether or not you should trust our software.
fr: Avec tout ceci en tête (qu'idéalement vous devriez essayer de vérifier), vous devriez pouvoir faire un choix éclairé sur le fait de faire confiance ou non à Tails.
