Repository: abeluck/cleanroom
Catalog: wiki/src/doc/installing_onto_a_usb_stick/linux.*.po
Languages: es, fr

source: [[!meta title="Installing onto a USB stick, for Linux"]]
es: [[!meta title="Instalar en una memoria USB, para Linux"]]
fr: [[!meta title="Installer sur une clé USB, sous Linux"]]

source: **Warning!** If at some point you are not sure about a device name it is recommended to stop proceeding otherwise **you might risk overwriting any hard drive on the system**. Proceed at your own discretion! We admit that this method is pretty crude at the moment and we are working on a more intuitive one.
es: **¡Advertencia!** Si no estás seguro del nombre del dispositivo es recomendable no continuar, de otra manera **corres el riesgo de sobreescribir otra unidad del sistema**. ¡Procede a tu criterio! Admitimos que este método es muy arcaico pero estamos trabajando en otro más intuitivo.
fr: **Attention!** Si à un moment vous n'êtes pas sur du nom du périphérique, il est recommandé de cesser de procéder davantage de cette manière **vous risquez d'écraser involontairement des données du système.** Vous êtes maître de vos actions ! Nous ne pouvons en être tenus responsables. Nous admettons que cette méthode est assez abrupte pour le moment et nous travaillons sur une version plus intuitive.

source: 1st method: from an ISO image
es: Método 1: desde una image ISO
fr: 1ère méthode : depuis une image ISO

source: If you [[downloaded|download]] an ISO image (the source), use this method to create a bootable USB stick (the destination) from it.
es: Si [[descargaste|download]] una imagen ISO (el origen), usa este método para crear una memoria USB de arranque (el destino) de ésta.
fr: Si vous avez [[téléchargé|download]] une image ISO (la source), utilisez cette méthode pour faire une clé USB Live (la destination).

source: Step 1: Find out the device name of the destination USB stick.
es: Paso 1: Encuentra el nombre de dispositivo de la memoria USB destino.

source: The device name should be something like `/dev/sdb`, `/dev/sdc`, etc.
es: El nombre del dispositivo debe ser algo como `/dev/sdb`, `/dev/sdc`, etc.
fr: Le nom du périphérique devrait être quelque chose qui ressemble à `/dev/sdb`, `/dev/sdc`, etc.

source: If you're not sure about the precise device name, do the following.
es: Si no estás seguro del nombre preciso del dispositivo, haz lo siguiente.
fr: Si vous n'êtes pas certain de son nom exact, faites comme suit.

source: Unplug the destination USB stick.
es: Desconecta la memoria USB de destino.
fr: Débranchez la clé USB de destination.

source: Open the Gnome disk utility from the menu *Applications* → *System Tools* → *Disk Utility*:
es: Abre la utilidad de discos de Gnome desde el menú *Aplicaciones* → *Herramientas del Sistema* → *Utilidad de Discos*:
fr: Ouvrez l'utilitaire de disque depuis *Applications* → *Outils système* → *Utilitaire de disque*.

source: The disk utility will list all the current storage devices on the left side of the screen:
es: La utilidad de discos listará todos los dispositivos de almacenamiento del lado izquierdo de la pantalla:
fr: L'utilitaire de disque va afficher tous les périphériques de stockage actuels sur le côté gauche de l'écran.

source: Plug back the destination USB stick. A new device should appear in the list of storage devices. Select it with the cursor:
es: Vuelve a conectar la memoria USB de destino. Un nuevo dispositivo debe aparecer en la lista de dispositivos de almacenamiento. Selecciónalo con el ratón:
fr: Branchez la clé USB de destination. Un nouveau disque devrait apparaitre dans la liste de disques de stockage. Sélectionnez-le avec le curseur.

source: Check that the description of the device corresponds to your destination USB stick, its brand, its size, etc. on the right side of the screen.
es: Revisa que la descripción del dispositivo corresponda con tu memoria USB destino, su marca, capacidad, etc. del lado derecho de la pantalla.
fr: Vérifiez que la descritpion du disque corresponde à votre clé USB source, sa nature, sa taille, etc. sur le côté droit de l'écran.

source: On this screenshot, the destination USB stick is a Kingston DataTraveler of 2.0 GB and its device name is `/dev/sdc`. Yours could be different.
es: En esta captura de pantalla, la memoria USB de destino es una Kingston DataTraveler de 2.0 GB y su nombre de dispositivo `/dev/sdc`. La tuya podría ser diferente.
fr: Dans l'exemple de cette copie d'écran, la clé USB de destination est nommée `sdc` ; le nom du périphérique serait donc `/dev/sdc`. Le vôtre peut être différent.

source: Step 2: Do the copy from the terminal.
es: Paso 2: Haz la copia desde la terminal.
fr: Etape 2 : Faire la copie depuis un Terminal

source: Open a terminal from the menu *Applications* → *Accessories* → *Terminal* and issue the following command, replacing `[tails.iso]` by the path to the ISO image that you want to copy and `[destination]` by the device name found in step 1.
es: Abre una terminal desde el menú *Aplicaciones* → *Accesorios* → *Terminal* e introduce el siguiente comando, reemplazando `[tails.iso]` por la ruta de la imagen ISO que quieres copiar y el `[destino]` por el nombre de dispositivo encontrado en el paso 1.
fr: Ouvrez un terminal dans le menu *Applications* → *Accessoires* → *Terminal* et lancez les deux commades suivantes, en remplaçant `[source]` par le nom trouvé à l'étape 2, and `[destination]` par le nom trouvé à l'étape 3.

source: cat [tails.iso] > [destination] && sync
es: cat [tails.iso] > [destino] && sync
fr: cat [tails.iso] > /dev/[destination] && sync

source: If you are not sure about the path to the ISO image or if you get a "No such file or directory" error, you can first type `cat`, followed by a space, and then drag and drop the icon of the ISO image from a file browser onto the terminal. This should insert the correct path to the ISO image in the terminal. Then type the rest of the command.
es: Si no estás seguro de la ruta de la imagen ISO o te aparece un mensaje de error " No se encontró el archivo", primero puedes teclear `cat`, seguido de espacio, y entonces arrastrar y soltar el icono de la imagen ISO desde el navegador de archivos dentro de la terminal. De esta forma debe insertarse de forma correcta la ruta de la imagen ISO en la terminal. Entonces teclea el resto del comando.
fr: Si vous n'êtes pas sûr du chemin menant à votre fichier image ISO ou si vous obtenez une erreur du type "No such file or directory", vous pouvez mettre le chemin correcte dans un Terminal en tapant *cat* puis en faisant glisser l'icône du fichier image ISO dans le Terminal avant le reste de la commande.

source: You should get something like this:
es: Debes conseguir algo como ésto:
fr: Vous pouvez obtenir quelque chose comme suit:

source: Step 3: Press enter and wait.
es: Paso 3: Presiona la tecla ENTRAR y espera.
fr: Etape 3: Appuyez sur entrée et patientez.

source: If you don't see any error message, Tails is being copied onto the key. The whole process might take a while, generally a few minutes. Be patient…
es: Si no ves mensajes de error, Tails se está copiando en la memoria USB. El proceso completo puede tomar un rato, por lo regular unos pocos minutos. Ten paciencia…
fr: Si vous ne voyez aucun message d'erreur, Tails est en train d'être copié vers la clé. Ce processus peut prendre du temps, entre quelques minutes et plus d'une heure. Soyez patient…

source: 2nd method: from another running Tails CD or USB
es: Método 2: en Tails iniciado desde un CD o USB
fr: Seconde méthode : à partir d'un Live CD ou USB Tails en cours de fonctionnement

source: If you are already able to run Tails from a CD or a USB stick (the source), use this method to clone it onto another USB stick (the destination).
es: Si estás usando Tails desde un CD o memoria USB (el origen), usa este método para clonarlo a otra memoria USB (el destino).
fr: Si vous êtes déja capable de faire tourner Tails depuis un CD ou une clé USB (la source), utilisez cette méthode pour le cloner vers une autre clé USB (la destination).

source: Step 1: Boot Tails from the source CD or USB stick.
es: Paso 1: inicia Tails desde el CD o memoria USB de origen.
fr: Etape 1 : Démarrer Tails depuis le CD ou clé USB source.

source: Step 2: Find out the device name of the source Tails.
es: Paso 2: Encuentra el nombre de dispositivo del origen de Tails.
fr: Etape 2 : Trouver le nom du périphérique source contenant Tails.

source: If you're running Tails from a CD the device name should be `/dev/cdrom`.
es: Si iniciaste Tails desde un CD el nombre del dispositivo debe ser `/dev/cdrom`.
fr: Si vous utilisez Tails à partir d'un CD, le nom du périphérique devrait être `/dev/cdrom`.

source: If you're running Tails from a USB stick, the device name should be something like `/dev/sdb`, `/dev/sdc`, etc.
es: Si iniciaste Tails desde una memoria USB, el nombre del dispositivo deber ser algo como `/dev/sdb`, `/dev/sdc`, etc.
fr: Si vous utilisez Tails à partir d'une clé USB, le nom du périphérique devrait être quelque chose qui ressemble à `/dev/sdb`, `/dev/sdc`, etc.

source: If you're not sure about it's precise device name, do the following.
es: Si no estás seguro del nombre preciso del dispositivo, haz lo siguiente.
fr: Si vous n'êtes pas certain de son nom exact, faites comme suit :

source: Search for your source USB stick in the list of storage devices on the left side of the screen:
es: Busca tu memoria USB de origen en la lista de dispositivos de almacenamiento del lado izquierdo de la pantalla:
fr: Cherchez votre clé USB source dans la liste des disque sur le côté droit de l'écran.

source: Check that the description of the device corresponds to your source USB stick, its brand, its size, etc. on the right side of the screen. In the *Volumes* part you should see that part of it is occupied by Tails.
es: Revisa que la descripción del dispositivo corresponda a tu memoria USB de origen, su marca, su capacidad, etc. del lado derecho de la pantalla. En la parte de los *Dispositivos* debes ver que parte de éste está ocupado por Tails.
fr: Vérifiez que la description du disque corresponde à votre clé USB source, sa nature, sa taille, etc. sur le côté droit de l'écran. Dans la partie *Volumes* vous devriez voir une partie occupée par Tails.

source: On this screenshot, the source USB stick is a Kingston DataTraveler of 3.9 GB and its device name is `/dev/sdb`. Yours could be different.
es: En esta captura de pantalla, la memoria USB de origen es una Kingston DataTraveler de 3.9 GB y su nombre de dispositivo es `/dev/sdb`. La tuya podría ser diferente.
fr: Dans l'exemple de cette copie d'écran, la clé USB source est nommé `sdb` ; le nom du périphérique serait donc `/dev/sdb`. Le vôtre peut être différent.

source: Step 3: Find out the device name of the destination USB stick.
es: Paso 3: Encuentra el nombre del dispositivo de la memoria USB de destino.
fr: Etape 3: Trouver le nom de périphérique de la clé USB de destination.

source: If you're not sure about it's precise device name, follow the step 1 of the 1st method.
es: Si no estás seguro al respecto del nombre del dispositivo, sigue el paso 1 del primer método.
fr: Si vous n'êtes pas certain de son nom exact, suivez l'étape 1 de la première méthode.

source: Step 4: Copy the source Tails onto the destination USB stick.
es: Paso 4: Copia el origen de Tails en la memoria USB de destino.
fr: Etape 4: Copier le Tails source vers la clé USB de destination.

source: Open a terminal from the menu *Applications* → *Accessories* → *Terminal* and issue the following command, replacing `[source]` by the device name found in step 2 and `[destination]` by the device name found in step 3.
es: Abre una terminal del menú *Aplicaciones* → *Accesorios* → *Terminal* e introduce el siguiente comando, reemplazando `[origen]` por el nombre del dispositivo dado en el paso 2 y `[destino]` por el nombre del dispositivo dado en el paso 3.
fr: Ouvrez un terminal dans le menu *Applications* → *Accessoires* → *Terminal* et lancez les deux commades suivantes, en remplaçant `[source]` par le nom trouvé à l'étape 2, and `[destination]` par le nom trouvé à l'étape 3.

source: cat [source] > [destination] && sync
es: cat [origen] > [destino] && sync
fr: cat /dev/[source] > /dev/[destination] && sync

source: In the example from the screenshots the command would be:
es: En el ejemplo de la captura de pantalla el comando debería ser así:
fr: Dans l'exemple de la copie d'écran les commandes seraient :

source: Step 5: Press enter and wait.
es: Paso 5: Presiona la tecla ENTRAR y espera.
fr: Etape 5: Appuyez sur entrée et patientez.

source: Troubleshooting
es: Solución de problemas
fr: Dépannage

source: cat: /dev/sdx: No such file or directory
es: cat: /dev/sdx: No existe el archivo o directorio

source: Then double-check the path to the disk image you entered in step 3.
es: Revisa la ruta a la imagen del disco indicado en el paso 3.
fr: Ensuite, revérifiez le chemin vers l'image disque que vous avez tapé à l'étape 3.

source: cat: /dev/sdc: Permission denied
es: cat: /dev/sdc: Permiso negado
fr: cat: /dev/sdc: Permission non accordée

source: You might also have committed a mistake in the device names, so please double-check them. If you're sure about the device names, this could be a permission problem and you could need to gain root privileges before running the command in the terminal. That could be:
es: Quizá cometiste un error en el nombre del dispositivo, por favor revísalo. Si estás seguro del nombre del dispositivo, entonces podría ser un problema de permisos y necesitarías tener privilegios de root antes de ejecutar el comando en la terminal. Lo cual puedes hacer así:
fr: Vous avez probablement fait une erreur lors de l'étape 2 ou 3 ; faites donc, s'il-vous-plaît, un seconde vérification. Si vous êtes sûr de vos noms de périphériques, il se peut qu'un problème de permissions ait survenu, et vous avez sans doute besoin de devenir super-utilisateur (`root`) avant de passer à l'étape 4. Cela peut être :

source: sudo su - cat [tails.iso] > [destination] && sync
es: sudo su - cat [tails.iso] > [destino] && sync

source: cat: tails.iso: No such file or directory
es: cat: tails.iso: No se encontró el archivo o directorio
fr: cat: tails.iso: No such file or directory (fichier ou dossier non trouvé)

source: Then you surely have committed a mistake on the path to the ISO image in step 2 of the 2nd method.
es: Seguramente cometiste un error en la ruta de la imagen ISO durante el paso 2 del segundo método.
fr: Vous vous êtes sans doute trompé sur l'emplacement de votre image ISO à l'étape 2 de la seconde méthode.

source: Step 1: Find out the device name of the destination USB stick
fr: Première étape : Trouver le nom de périphérique de la clé USB de destination.

source: [[!img linux/gnome_disk_utility.png link=no alt="Applications → System Tools → Disk Utility"]]
fr: Ouvrez l'utilitaire de disque depuis *Applications* → *Outils système* → *Utilitaire de disque*.

source: [[!img linux/storage_devices.png link=no alt="Storage devices, including USB peripherals"]]
fr: [[!img linux/storage_devices.png link=no alt="Disques de stockage, incluant les périphériques USB"]]
